"""
and, or
&, |
"""

# 1. 当被运算对象为 True, False 时，两组运算符没有区别
print(">>> 1<2 and 3<4:", 1<2 and 3<4)
print(">>> 1<2 & 3<4:", 1<2 & 3<4)

# 2. 当被运算对象为数值变量时，有区别：&, | 进行二进制的按位逻辑运算
print(">>> 0 and 1:", 0 and 1)  # 有 0，则返回 0
print(">>> 1 and 2:", 1 and 2)  # 没 0，则返回最后一个值
print(">>> 1 & 2:", 1 & 2)  # 0001 & 0010 = 0

# 3. and 与 or 可以当“三目”用
x = 123
print(">>> sign =", x > 0 and 1 or -1)
y = -123
print(">>> sign =", y > 0 and 1 or -1)

# 4. 当被运算对象为逻辑变量与数值变量混合的时候
# and, or 按正常逻辑进行返回
# &, | 将先把 True 认为是 1，把 False 认为是 0，再进行逻辑“与或”运算
print(">>> -3<-2<-1<False and True:", -3<-2<-1<False and True)
print(">>> True | 2:", True | 2)  # 0001 | 0010 = 0011
